
Если Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов и ЗначениеЗаполнено(Объект.Дата) и ЗначениеЗаполнено(Объект.Номер) Тогда
	Объект.ИдентификаторПлатежа = ОбщегоНазначенияУТ.ПолучитьУникальныйИдентификаторПлатежа(Объект);
Иначе
	Объект.ИдентификаторПлатежа = Неопределено;
КонецЕсли;

Если не ЗначениеЗаполнено(Объект.ПорядокРасчетов) тогда
	Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
КонецЕсли;

Если Объект.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду("643") тогда
	Объект.ГруппаФинансовогоУчета = Справочники.ГруппыФинансовогоУчетаРасчетов.НайтиПоНаименованию("Расчеты за товары, услуги и прочие активы (в рублях)");
иначе
	Объект.ГруппаФинансовогоУчета = Справочники.ГруппыФинансовогоУчетаРасчетов.НайтиПоНаименованию("Расчеты за товары, услуги и прочие активы (в валюте)");
КонецЕсли;

Если не ЗначениеЗаполнено(Объект.Партнер) тогда
	Объект.Партнер = Объект.Контрагент.Партнер;	
КонецЕсли;


Если не ЗначениеЗаполнено(Объект.ПорядокОплаты) тогда
	Объект.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях;  
КонецЕсли; 
