Запрос = Новый Запрос;
Запрос.Текст = "
|ВЫБРАТЬ
|	СборкаЗапасов.Ссылка
|ИЗ
|	Документ.СборкаЗапасов КАК СборкаЗапасов
|ГДЕ
|	СборкаЗапасов.Дата между &ДатаНачала и &ДатаОкончания";

Запрос.УстановитьПараметр("ДатаНачала"   , ДатаНачала);
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);


Результат = Запрос.Выполнить().Выбрать();

Пока Результат.Следующий() Цикл
	
	Если Результат.Ссылка.Запасы.Количество() > 0 Тогда
		ВыгрузитьПоПравилу(Результат.Ссылка, , , , "ВыпускСписание");
	КонецЕсли;	
	
	ВыгрузитьПоПравилу(Результат.Ссылка, , , , "ВыпускПродукции");

	
КонецЦикла;
