Если не ЗначениеЗаполнено(Объект.ПорядокРасчетов) тогда
	Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
КонецЕсли;


Если не ЗначениеЗаполнено(Объект.ПорядокОплаты) тогда
	Объект.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях;  
КонецЕсли;

Если Не ЗначениеЗаполнено(Объект.Партнер) Тогда 
	Объект.Партнер = Объект.Контрагент.Партнер;
КонецЕсли;	


СтавкаНДС = Перечисления.СтавкиНДС.НДС18;

Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС  Тогда
	СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;  	
КонецЕсли;	

ОсновнойСклад = Справочники.Склады.НайтиПоНаименованию("Склад НСМ", Истина);

Если СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда 
	Объект.Склад = ОсновнойСклад; 	
КонецЕсли;	


Для каждого строка из Объект.Товары Цикл
	
	//строка.СтавкаНДС = СтавкаНДС;
	
	Если ЗначениеЗаполнено(Объект.Склад) Тогда 
		
		Строка.Склад = ОсновнойСклад;
		
	КонецЕсли;	
	
КонецЦикла;
