Если не ЗначениеЗаполнено(Объект.ПорядокРасчетов) тогда
	Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
КонецЕсли;


Если не ЗначениеЗаполнено(Объект.ПорядокОплаты) тогда
	Объект.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях;  
КонецЕсли; 

Если Не ЗначениеЗаполнено(Объект.Партнер) Тогда 
	Объект.Партнер = Объект.Контрагент.Партнер;
КонецЕсли;

Для каждого строка из Объект.Услуги Цикл
	Если Не ЗначениеЗаполнено(строка.Содержание) Тогда 
		Строка.Содержание = Строка.Номенклатура.Наименование;
	КонецЕсли;	
КонецЦикла;
