ТекстСообщенияЗаписи = "";
ТекстСообщенияОшибки = "";

Для каждого СтрокаТч Из Параметры.ТаблицаДокументов Цикл


	//Если СтрокаТч.Действие = "Отмена"  И Не СтрокаТч.Ссылка.Проведен Тогда
	//    Если СтрокаТч.Ссылка.ПометкаУдаления Тогда  //Для снятия пометки удаления
	//        Попытка
	//            ДокОбъект = СтрокаТч.Ссылка.ПолучитьОбъект();
	//            ДокОбъект.ПометкаУдаления = Ложь;
	//            ДокОбъект.Записать();
	//        Исключение
	//        КонецПопытки;
	//    КонецЕсли;

	//    Продолжить;

	//КонецЕсли;

	Если СтрокаТч.Действие = "Проведение" Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	Иначе
		РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
	КонецЕсли;

	Попытка
	    ДокОбъект = СтрокаТч.Ссылка.ПолучитьОбъект();
	    Если (СтрокаТч.Действие <> "Удаление" Или  СтрокаТч.Ссылка.Проведен) Тогда
	        ДокОбъект.Записать(РежимЗаписи);
	        ТекстСообщенияЗаписи = ТекстСообщенияЗаписи +?(РежимЗаписи = РежимЗаписиДокумента.Проведение,
	        "Проведен ","Отменено проведение ")
	        + Строка(СтрокаТч.Ссылка) + Символы.ПС;
	    КонецЕсли;

		//Если СтрокаТч.Действие = "Удаление" Тогда
		//    ДокОбъект.ПометкаУдаления = Истина;
		//    ДокОбъект.Записать();
		//ИначеЕсли СтрокаТч.Ссылка.ПометкаУдаления Тогда
		//    ДокОбъект.ПометкаУдаления = Ложь;
		//    ДокОбъект.Записать();
		//КонецЕсли;
	Исключение    

	ТекстСообщенияОшибки = ТекстСообщенияОшибки + Строка(СтрокаТч.Ссылка)+ " : "+ОписаниеОшибки()+ Символы.ПС;

	КонецПопытки;
КонецЦикла;

Если Не ПустаяСтрока(ТекстСообщенияЗаписи) Тогда
	Сообщить(ТекстСообщенияЗаписи);
КонецЕсли;

Если Не ПустаяСтрока(ТекстСообщенияОшибки) Тогда
	Сообщить("Ошибки при отмене проведения: "+ Символы.ПС + ТекстСообщенияОшибки);
КонецЕсли;
Параметры.Удалить("ТаблицаДокументов");
