Если не ЗначениеЗаполнено(Объект.Валюта) тогда
	Объект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
КонецЕсли;


Если не ЗначениеЗаполнено(Объект.Подразделение) тогда
	Объект.Подразделение = Справочники.СтруктураПредприятия.НайтиПоНаименованию("Изыскательская партия (добыча ПГС)", Истина);
КонецЕсли;

Объект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;

//Объект.ВыпускПодДеятельность = Перечисления.ТипыНалогоОбложенияНДС.ПродажаОблагаетсяНДС

Для каждого строка из Объект.Товары Цикл
	строка.Склад = Объект.Склад;
КонецЦикла;
